# Taps
tap "FelixKratz/formulae"
tap "koekeishiya/formulae"
tap "supabase/tap"
tap "tursodatabase/tap"

brew "vercel-cli"
brew "btop"
brew "docker"
brew "gh"
brew "git"
brew "wget"
brew "curl"
brew "opencode"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lazygit"
brew "neovim"
brew "pipx"
brew "poetry"
brew "starship"
brew "tree"
brew "yazi"
brew "zellij"
brew "pnpm"
brew "fnm"
brew "tursodatabase/tap/turso"
brew "maven"
brew "act"
brew "b2-tools"
brew "jira-cli"
brew "supabase/tap/supabase"

# Yazi dependencies
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "imagemagick"
brew "jq"
brew "p7zip"
brew "poppler"
brew "ripgrep"
brew "zoxide"

# Languages
brew "go"
brew "eslint"
brew "stylua"

# Casks
cask "libreoffice"
cask "discord"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "obs"
cask "postman"
cask "qbittorrent"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "webstorm"
cask "anki"
cask "ghostty"
cask "android-studio"
cask "google-chrome"
cask "capcut"
cask "messenger"
cask "claude-code"
cask "karabiner-elements"
cask "figma"
cask "db-browser-for-sqlite"

