# General
brew "FelixKratz/formulae/borders"
brew "atlassian/acli/acli"
brew "b2-tools"
brew "bitwarden-cli"
brew "curl"
brew "docker"
brew "fastlane"
brew "gh"
brew "gitleaks"
brew "git"
brew "git-delta"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lazygit"
brew "neovim"
brew "tree-sitter-cli"
brew "opencode"
brew "pnpm"
brew "pre-commit"
brew "starship"
brew "supabase"
brew "tursodatabase/tap/turso"
brew "vercel-cli"
brew "wget"
brew "yarn"
brew "yazi"
brew "zellij"

# Yazi dependencies
brew "bat"
brew "chafa"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "imagemagick"
brew "jq"
brew "p7zip"
brew "poppler"
brew "ripgrep"
brew "unar"
brew "zoxide"

# Grammar
brew "harper"

# Languages
brew "cocoapods"
brew "eslint"
brew "fnm"
brew "go"
brew "luacheck"
brew "luarocks"
brew "maven"
brew "oxfmt"
brew "pipx"
brew "python"
brew "poetry"
brew "ruby@3"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "stylua"

# Casks
cask "android-studio"
cask "claude-code"
cask "cursor"
cask "drawpen"
cask "espanso"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "keyboardcleantool"
cask "raycast"
cask "minisim"
cask "figma"
cask "db-browser-for-sqlite"
cask "losslesscut"
cask "obs"
cask "obsidian"
cask "stremio"
cask "thunderbird"
cask "transmission"
cask "webtorrent"
cask "discord"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "slack"

#  Backend
cask "dbeaver-community"
cask "gcloud-cli"
brew "cloud-sql-proxy"
brew "postgresql@15"
brew "colima"
brew "lazysql"
brew "lazydocker"
brew "visidata"
