# Taps
tap "FelixKratz/formulae"
tap "koekeishiya/formulae"
tap "atlassian/homebrew-acli"

brew "FelixKratz/formulae/borders"
brew "acli"
brew "b2-tools"
brew "bitwarden-cli"
brew "btop"
brew "colima"
brew "curl"
brew "docker"
brew "fastlane"
brew "ffmpeg"
brew "flux"
brew "gh"
brew "git"
brew "git-delta"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lazygit"
brew "neovim"
brew "opencode"
brew "pnpm"
brew "starship"
brew "supabase"
brew "tree"
brew "trufflehog"
brew "vercel-cli"
brew "wget"
brew "yarn"
brew "yazi"
brew "zellij"

# Yazi dependencies
brew "bat"
brew "chafa"
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "imagemagick"
brew "jq"
brew "p7zip"
brew "poppler"
brew "ripgrep"
brew "unar"
brew "zoxide"

# Languages
brew "cocoapods"
brew "eslint"
brew "fnm"
brew "go"
brew "luacheck"
brew "luarocks"
brew "maven"
brew "pipx"
brew "poetry"
brew "ruby@3"
brew "rust"
brew "shfmt"
brew "stylua"

# Casks
cask "android-studio"
cask "db-browser-for-sqlite"
cask "discord"
cask "espanso"
cask "figma"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "kitty"
cask "losslesscut"
cask "obs"
cask "openmtp"
cask "minisim"
cask "postman"
cask "raycast"
cask "stremio"

# Backend
brew "postgresql@15"
